completed_data = {
    "1학년 1학기": {
        "GR": [("AAK11086", "수학1", 3, "A+"), ("AAK17008", "가치와비전", 1, "P"), ("AAK12043", "글쓰기", 3, "A+"), ("AAK12046", "영어1", 2, "B+")],
        "ME": [("ACS10010", "전산학기초", 3, "A+"), ("ACS12022", "프로그래밍기초", 3, "B+"), ("ACS14002", "하드웨어개론", 3, "B+")],
    },
    "1학년 2학기": {
        "GR": [("AAK12041", "글로벌잉글리시", 2, "A+"), ("AAK11087", "수학2", 3, "B+"), ("AAK12047", "영어2", 2, "A+"), ("AAK17009", "창의와실천", 1, "P")],
        "GE": [("AAK11097", "물리학실험", 1, "A0"), ("AAK11096", "물리학", 3, "A0")],
        "MR": [("ACS12021", "프로그래밍", 3, "A+")],
        "ME": [("ACS10033", "창의적공학설계", 3, "B+")]
    },
    "2학년 1학기": {
        "GE": [("AAK10048", "미디어와공동체", 3, "B+"), ("AAK14102", "소비자와마케팅", 3, "B+"), ("AAK20013", "현대인의패션라이프", 2, "A+")],
        "ME": [("ACS10022", "유닉스기초", 3, "C+"), ("ACS10041", "선형대수학", 3, "B0"), ("ACS11010", "이산수학", 3, "B+"), ("ACS20010", "자료구조", 3, "B+")],
    },
    "2학년 2학기": {
        "GE": [("AAK10047", "서양문명과역사", 3, "B+"), ("AAK10050", "노동인권과법", 3, "A0"), ("AAK15007", "패션과이미지코드", 2, "A+")],
        "GR": [("AAK26007", "진로와미래(취업과창직)", 1, "P")],
        "ME": [("ACS22022", "파이썬프로그래밍", 3, "C+"), ("ACS24020", "컴퓨터구조", 3, "B+"), ("ACS26015", "데이터베이스", 3, "A+"), ("ACS32021", "자바", 3, "A+")],
    }
}